#include<stdio.h>
#include<math.h>
#include<iostream>
#include<stdint.h>
#include<time.h>

using namespace std;

void main()
{
	int n;
	setlocale(LC_ALL, "Russian");
	srand(time(NULL));
	do
	{
		cout << "введите номер задания:";
		cin >> n;
		switch (n) {

			//1.	Дано целое число в двоичной системе счисления, т.е. последовательность цифр  0 и 1. 
			//Составить программу перевода этого числа в восьмеричную систему счисления.
		case 1: {
			int a = 0, i, j, m[4] = { 0 }, k = 7, l[3] = { 0 },a1;

			cout << "Исходные массивы: " << endl;
			for (i = 0; i < 8; i++)
			{
				m[i] = 0 + rand() % 2;
				cout << m[i] << "\t";
			}
			cout << endl;

			for (i = 0; i < 8; i++)
			{
				a += m[i] * pow(2, k);
				k--;
			}
			cout << "Число в десятичной системе: " << a << endl;

			for (i = 0; i < 3; i++)
			{
				if (a != 1)
				{
					l[i] = a % 8;
					a = a / 8;
				}
				else
					l[i] = a;
					}

			a1 = l[2]*100+l[1]*10+l[0];
			cout << "Число в восьмеричной системе: " << a1 << endl;
			

		} break;

			//2.	Ввести два массива действительных чисел, состоящих из 7 и  9 элементов. Сформировать третий массив из упорядоченных по убыванию значений обоих массивов.
		case 2: {
			int m[9] = { 0 }, k[7] = { 0 }, i, j, l[16] = { 0 };

			cout << "Исходные массивы: " << endl;
			for (i = 0; i < 9; i++)
			{
				m[i] = -10 + rand() % 30;
				cout << m[i] << "\t";
			}
			cout << endl;

			for (i = 0; i < 7; i++)
			{
				k[i] = -10 + rand() % 30;
				cout << m[i] << "\t";
			}
			cout << endl;

			for (i = 0; i < 9; i++)
				l[i] = m[i];

			for (i = 9; i < 16; i++)
				l[i] = k[i];

			cout << "Совмещенный массив: " << endl;
			for (i = 0; i < 16; i++)
				cout << l[i] << "\t";
			cout << endl;


			for (i = 0; i < 16; i++)
			{
				for (j = 15; j > 0; j--)
				{
					if (l[j - 1] < l[j])
					{
						int g = l[j - 1];
						l[j - 1] = l[j];
						l[j] = g;
					}
				}

			}

			cout << "После преобразования: " << endl;
			for (i = 0; i < 16; i++)
				cout << l[i] << endl;

		} break;

			//3.	Ввести массив, в котором только два одинаковых элемента. Определить их местоположение.
		case 3: {
			int m[10] = { 0 }, i, j;

			cout << "Введите массив, в котором только два одинаковых элемента : " << endl;
			for (i = 0; i < 10; i++)
			{
				cin >> m[i];
				cout << endl;
			}

			for (i = 0; i < 10; i++)
			{
				for (j = i + 1; j < 10; j++)
				{
					if (m[i] == m[j])
					{
						cout << "1 элемент находится в : " << i << endl;
						cout << "2 элемент находится в : " << j << endl;
					}
				}
			}
		} break;

			//4.	Задан целочисленный массив. Определить, образуют ли значения его элементов геометрическую прогрессию.
			//Если «да» – вывести знаменатель прогрессии, если «нет» – ответ «не образуют». 
		case 4: {
			int i, m[10] = { 0 }, q, l, j;
			cout << "Введите массив: " << endl;               //пример геометрической прогрессии: 2,4,8,16,32,64,128,256,512,1024
			for (i = 0; i < 10; i++)
			{ 
				cin >> m[i];
				cout << endl;
			}

			for (j = 2; j < 10; j++)
			{
				if (m[0] != 0)
				{
					for (i = 1; i < 8; i++)
					{
						if ((m[i] == m[i - 1] * j)&&(m[i] * m[i] == m[i - 1] * m[i + 1]))
						{
							l = 1;
							q = j;
						}
					}
				}
			}
			if (l == 1)
				cout << "Последовательность является геометрической прогрессией." << "\t" << "знаменеатель прогрессии:" << q << endl;
			else
				cout << "Последовательность не является геометрической прогрессией." << endl;
			
		} break;

			//5.	Отсортировать по убыванию элементов последнего столбца целочисленный двухмерный массив 5×4
		case 5: {

			int m[5][4] = { { 0 },{ 0 } }, i, j;

			for (i = 0; i < 5; i++)
			{
				for (j = 0; j < 4; j++)
				{
					m[i][j] = 0 + rand() % 100;
					cout << m[i][j] << "\t";
				}
				cout << endl;
			}

			for (i = 0; i < 5; i++)
			{
				for (j = 4; j > i; j--)
				{
					if (m[j - 1][3] < m[j][3])
					{
						int l = m[j - 1][3];
						m[j - 1][3] = m[j][3];
						m[j][3] = l;
					}
				}
			}

			cout << "массив после сортировки: " << endl;
			for (i = 0; i < 5; i++)
			{
				for (j = 0; j < 4; j++)
				{

					cout << m[i][j] << "\t";
				}
				cout << endl;
			}

		} break;

			//6.	В матрице А(3-строки,4-столбца) поменять местами наименьшие элементы в первой и третей строке.
		case 6: {
			int m[3][4] = { { 0 },{ 0 } }, i, j, min, index, index1, min1;

			for (i = 0; i < 3; i++)
			{
				for (j = 0; j < 4; j++)
				{
					m[i][j] = 0 + rand() % 100;
					cout << m[i][j] << "\t";
				}
				cout << endl;
			}

			min = m[0][0];
			min1 = m[2][0];

			for (j = 0; j < 4; j++)
			{
				if (m[0][j] < min)
				{
					min = m[0][j];
					index = j;
				}
				if (m[2][j] < min)
				{
					min1 = m[2][j];
					index1 = j;
				}
			}
			cout << "Наименьший элемент 1 строки: " << min << endl;
			cout << "Наименьший элемент 3 строки: " << min1 << endl;

			int k = m[0][index];
			m[0][index] = m[2][index1];
			m[2][index1] = k;

			for (i = 0; i < 3; i++)
			{
				for (j = 0; j < 4; j++)
				{
					cout << m[i][j] << "\t";
				}
				cout << endl;
			}


		} break;

			//7.	Дан двухмерный массив 5×6. Определить среднее арифметическое каждого столбца,  определить максимум и минимум каждой строки.
		case 7: {
			int m[5][6] = { { 0 },{ 0 } }, p = 0, sr, i, j, max, min;

			for (i = 0; i < 5; i++)
			{
				for (j = 0; j < 6; j++)
				{
					m[i][j] = 0 + rand() % 100;
					cout << m[i][j] << "\t";
				}
				cout << endl;
			}
			for (i = 0; i < 5; i++)
			{
				max = m[0][0];
				min = m[0][0];
				for (j = 0; j < 6; j++)
				{
					if (m[i][j] > max)
					{
						max = m[i][j];
					}
					if (m[i][j] < min)
					{
						min = m[i][j];
					}

				}
				cout << "min " << i << "строки: " << min << endl;
				cout << "max " << i << "строки: " << max << endl;
			}

			for (j = 0; j < 6; j++)
			{
				p = 0;
				for (i = 0; i < 5; i++)
				{
					p += m[i][j];
				}
				sr = p / 5;
				cout << "среднее арифметическое " << j << " столбца: " << sr << endl;
			}


		} break;

			//8.	Дан двухмерный массив n×m элементов, найти количество четных и нечетных чисел в массиве.
		case 8: {
			int m[5][6] = { { 0 },{ 0 } }, chet = 0, nechet = 0, i, j;

			for (i = 0; i < 5; i++)
			{
				for (j = 0; j < 6; j++)
				{
					m[i][j] = 0 + rand() % 100;
					cout << m[i][j] << "\t";
				}
				cout << endl;
			}

			for (i = 0; i < 5; i++)
			{
				for (j = 0; j < 6; j++)
				{
					if (m[i][j] % 2 == 0)
					{
						chet++;
					}
					else
					{
						nechet++;
					}
				}
			}

			cout << " количество четных чисел в массиве: " << chet << endl;
			cout << " количество нечетных чисел в массиве: " << nechet << endl;

		} break;

			//9.	Дан двухмерный массив n ×m элементов. Определить, сколько раз встречается число 7 среди элементов массива.
		case 9: {
			int m[5][6] = { { 0 },{ 0 } }, k = 0, i, j;

			for (i = 0; i < 5; i++)
			{
				for (j = 0; j < 6; j++)
				{
					m[i][j] = 0 + rand() % 10;
					cout << m[i][j] << "\t";
				}
				cout << endl;
			}

			for (i = 0; i < 5; i++)
			{
				for (j = 0; j < 6; j++)
				{
					if (m[i][j] == 7)
						k++;
				}
			}

			cout << " число 7 встречается  " << k << " раз среди элементов массива." << endl;
		} break;

			//10.	Дан массив из n × m элементов. Найти индексы первого наименьшего  элемента массива
		case 10: {

			int m[5][6] = { { 0 },{ 0 } }, index1, index2, i, j, min;

			for (i = 0; i < 5; i++)
			{
				for (j = 0; j < 6; j++)
				{
					m[i][j] = 0 + rand() % 10;
					cout << m[i][j] << "\t";
				}
				cout << endl;
			}

			min = m[0][0];
			for (i = 0; i < 5; i++)
			{
				for (j = 0; j < 6; j++)
				{
					if (m[i][j] < min)
					{
						min = m[i][j];
						index1 = i;
						index2 = j;
					}
				}
			}
			cout << "наименьший элемент массива: " << min << endl;
			cout << "индексы наименьшего  элемента массива: " << index1 << "\t" << index2 << endl;

		} break;

		}
	} while (n > 0);
}
